In [2]:
import pandas as pd

In [3]:
data = {
    "Movie":["Shawashank Redemption", "Inception", "Dune", "Skyfall", "A Wednesday", "Forrest Gump", "The Godfather"],
    "IMDB Rating": [9.9, 9.81, 8.6, 8.1, 9.1, 8.8, 9.0],
    "Production":["Universal", "Universal", "Fox Stars", "T series", "Fox Stars", "Universal", "Fox Stars"]
}

df_movies = pd.DataFrame(data)
df_movies.head()

                   Movie  IMDB Rating Production
0  Shawashank Redemption         9.90  Universal
1              Inception         9.81  Universal
2                   Dune         8.60  Fox Stars
3                Skyfall         8.10   T series
4            A Wednesday         9.10  Fox Stars

In [4]:
import warnings
warnings.filterwarnings("ignore")

## Mean, Median, Min, Max

In [5]:
print(df_movies.groupby(["Production"]).mean())

            IMDB Rating
Production
Fox Stars      8.900000
T series       8.100000
Universal      9.503333

In [6]:
print(df_movies.groupby(["Production"]).median())

            IMDB Rating
Production
Fox Stars          9.00
T series           8.10
Universal          9.81

In [7]:
print(df_movies.groupby(["Production"]).min())

                   Movie  IMDB Rating
Production
Fox Stars    A Wednesday          8.6
T series         Skyfall          8.1
Universal   Forrest Gump          8.8

In [8]:
print(df_movies.groupby(["Production"]).max())

                            Movie  IMDB Rating
Production
Fox Stars           The Godfather          9.1
T series                  Skyfall          8.1
Universal   Shawashank Redemption          9.9

In [9]:
print(df_movies.groupby(["Production"]).count())

            Movie  IMDB Rating
Production
Fox Stars       3            3
T series        1            1
Universal       3            3

## Level

In [10]:
arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
          ['Captive', 'Wild', 'Captive', 'Wild']]

In [11]:
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
                  index=index)
df

                Max Speed
Animal Type
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0

In [12]:
df.groupby(level=0).mean()

        Max Speed
Animal
Falcon      370.0
Parrot       25.0

In [13]:
df.groupby(level="Type").mean()

         Max Speed
Type
Captive      210.0
Wild         185.0

## by()

In [14]:
df_movies.groupby(by=["IMDB Rating"]).sum()

                             Movie Production
IMDB Rating
8.10                       Skyfall   T series
8.60                          Dune  Fox Stars
8.80                  Forrest Gump  Universal
9.00                 The Godfather  Fox Stars
9.10                   A Wednesday  Fox Stars
9.81                     Inception  Universal
9.90         Shawashank Redemption  Universal

In [15]:
l = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
df = pd.DataFrame(l, columns=["a", "b", "c"])

## sum()

In [16]:
df.groupby(by=["b"]).sum()

     a  c
b
1.0  2  3
2.0  2  5

## dropna

In [17]:
df.groupby(by=["b"], dropna=False).sum()

     a  c
b
1.0  2  3
2.0  2  5
NaN  1  4

## group_keys

In [18]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.]})
df.groupby("Animal", group_keys=True)[['Max Speed']].apply(lambda x: x)

          Max Speed
Animal
Falcon 0      380.0
       1      370.0
Parrot 2       24.0
       3       26.0

In [19]:
df.groupby("Animal", group_keys=False)[['Max Speed']].apply(lambda x: x)

   Max Speed
0      380.0
1      370.0
2       24.0
3       26.0

## Aggregate

In [20]:
df.groupby('Animal').agg('max')

        Max Speed
Animal
Falcon      380.0
Parrot       26.0

In [21]:
df.corr()

           Max Speed
Max Speed        1.0